benchmark_results/results/gemma4-31b/google_gemma-4-31B-it_in20000_out5000_rate10.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff982348cc0>, trust_remote_code=False, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=10, model='google/gemma-4-31B-it', input_len=20000, output_len=5000, tokenizer='./gemma-4-31B-it', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-7deeee08-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-14 10:31:26 [datasets.py:700] Sampling input_len from [20000, 20000] and output_len from [5000, 5000]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 10

  0%|          | 0/500 [00:00<?, ?it/s]
  0%|          | 1/500 [02:14<18:36:51, 134.29s/it]
  1%|          | 3/500 [02:14<4:48:43, 34.86s/it]  
  1%|          | 5/500 [02:14<2:19:55, 16.96s/it]
  1%|▏         | 7/500 [02:16<1:23:49, 10.20s/it]
  2%|▏         | 9/500 [02:20<58:28,  7.15s/it]  
  2%|▏         | 10/500 [02:23<51:37,  6.32s/it]
  2%|▏         | 11/500 [04:21<4:22:59, 32.27s/it]
  3%|▎         | 14/500 [04:21<2:11:07, 16.19s/it]
  3%|▎         | 16/500 [04:22<1:29:32, 11.10s/it]
  3%|▎         | 17/500 [04:26<1:17:34,  9.64s/it]
  4%|▎         | 18/500 [04:28<1:04:43,  8.06s/it]
  4%|▍         | 19/500 [04:30<53:48,  6.71s/it]  
  4%|▍         | 20/500 [04:33<46:31,  5.82s/it]
  4%|▍         | 21/500 [06:29<4:36:38, 34.65s/it]
  5%|▍         | 24/500 [06:29<2:09:42, 16.35s/it]
  5%|▌         | 26/500 [06:31<1:28:37, 11.22s/it]
  5%|▌         | 27/500 [06:35<1:16:31,  9.71s/it]
  6%|▌         | 28/500 [06:37<1:03:21,  8.05s/it]
  6%|▌         | 29/500 [06:39<52:04,  6.63s/it]  
  6%|▌         | 30/500 [06:42<45:37,  5.82s/it]
  6%|▌         | 31/500 [08:40<4:37:34, 35.51s/it]
  7%|▋         | 34/500 [08:40<2:09:22, 16.66s/it]
  7%|▋         | 36/500 [08:40<1:25:39, 11.08s/it]
  8%|▊         | 38/500 [08:46<1:04:23,  8.36s/it]
  8%|▊         | 39/500 [08:48<55:07,  7.18s/it]  
  8%|▊         | 40/500 [08:51<48:43,  6.36s/it]
  8%|▊         | 41/500 [10:50<4:08:41, 32.51s/it]
  9%|▊         | 43/500 [10:50<2:28:58, 19.56s/it]
  9%|▉         | 45/500 [10:50<1:34:39, 12.48s/it]
  9%|▉         | 47/500 [10:54<1:07:10,  8.90s/it]
 10%|▉         | 48/500 [10:56<57:04,  7.58s/it]  
 10%|▉         | 49/500 [10:59<48:13,  6.42s/it]
 10%|█         | 50/500 [11:02<42:16,  5.64s/it]
 10%|█         | 51/500 [13:03<4:21:58, 35.01s/it]
 11%|█         | 53/500 [13:03<2:31:21, 20.32s/it]
 11%|█         | 55/500 [13:03<1:34:17, 12.71s/it]
 11%|█▏        | 57/500 [13:09<1:08:08,  9.23s/it]
 12%|█▏        | 58/500 [13:11<57:28,  7.80s/it]  
 12%|█▏        | 59/500 [13:13<47:57,  6.52s/it]
 12%|█▏        | 60/500 [13:16<42:23,  5.78s/it]
 12%|█▏        | 61/500 [15:14<4:12:13, 34.47s/it]
 13%|█▎        | 64/500 [15:14<1:59:40, 16.47s/it]
 13%|█▎        | 66/500 [15:16<1:21:57, 11.33s/it]
 13%|█▎        | 67/500 [15:20<1:10:47,  9.81s/it]
 14%|█▎        | 68/500 [15:22<58:37,  8.14s/it]  
 14%|█▍        | 69/500 [15:24<48:12,  6.71s/it]
 14%|█▍        | 70/500 [15:27<42:18,  5.90s/it]
 14%|█▍        | 71/500 [17:25<4:14:07, 35.54s/it]
 15%|█▍        | 73/500 [17:26<2:24:16, 20.27s/it]
 15%|█▌        | 75/500 [17:26<1:29:04, 12.58s/it]
 15%|█▌        | 77/500 [17:31<1:04:13,  9.11s/it]
 16%|█▌        | 78/500 [17:33<54:06,  7.69s/it]  
 16%|█▌        | 79/500 [17:35<45:09,  6.44s/it]
 16%|█▌        | 80/500 [17:39<40:02,  5.72s/it]
 16%|█▌        | 81/500 [19:37<4:01:08, 34.53s/it]
 17%|█▋        | 83/500 [19:37<2:18:36, 19.94s/it]
 17%|█▋        | 86/500 [19:39<1:14:29, 10.80s/it]
 17%|█▋        | 87/500 [19:42<1:04:59,  9.44s/it]
 18%|█▊        | 88/500 [19:45<54:16,  7.91s/it]  
 18%|█▊        | 89/500 [19:47<44:55,  6.56s/it]
 18%|█▊        | 90/500 [19:50<39:38,  5.80s/it]
 18%|█▊        | 91/500 [21:48<3:59:19, 35.11s/it]
 19%|█▉        | 94/500 [21:48<1:52:20, 16.60s/it]
 19%|█▉        | 96/500 [21:50<1:16:44, 11.40s/it]
 19%|█▉        | 97/500 [21:54<1:06:09,  9.85s/it]
 20%|█▉        | 98/500 [21:56<54:44,  8.17s/it]  
 20%|█▉        | 99/500 [21:58<44:57,  6.73s/it]
 20%|██        | 100/500 [22:01<39:23,  5.91s/it]
 20%|██        | 101/500 [24:00<3:57:04, 35.65s/it]
 21%|██        | 103/500 [24:00<2:14:28, 20.32s/it]
 21%|██        | 104/500 [24:00<1:42:46, 15.57s/it]
 22%|██▏       | 108/500 [24:00<43:31,  6.66s/it]  
 22%|██▏       | 110/500 [24:04<34:31,  5.31s/it]
 22%|██▏       | 111/500 [26:12<2:51:31, 26.46s/it]
 23%|██▎       | 114/500 [26:13<1:38:07, 15.25s/it]
 23%|██▎       | 117/500 [26:16<1:03:07,  9.89s/it]
 24%|██▎       | 118/500 [26:18<55:40,  8.74s/it]  
 24%|██▍       | 119/500 [26:20<47:57,  7.55s/it]
 24%|██▍       | 120/500 [26:23<42:23,  6.69s/it]
 24%|██▍       | 121/500 [28:22<3:20:39, 31.77s/it]
 25%|██▍       | 124/500 [28:22<1:41:27, 16.19s/it]
 25%|██▌       | 125/500 [28:25<1:25:38, 13.70s/it]
 25%|██▌       | 126/500 [28:27<1:10:22, 11.29s/it]
 25%|██▌       | 127/500 [28:30<58:13,  9.37s/it]  
 26%|██▌       | 128/500 [28:32<47:07,  7.60s/it]
 26%|██▌       | 129/500 [28:35<38:11,  6.18s/it]
 26%|██▌       | 130/500 [28:38<33:13,  5.39s/it]
 26%|██▌       | 131/500 [30:31<3:39:10, 35.64s/it]
 27%|██▋       | 133/500 [30:31<2:01:05, 19.80s/it]
 27%|██▋       | 135/500 [30:31<1:13:47, 12.13s/it]
 27%|██▋       | 136/500 [30:32<58:34,  9.66s/it]  
 27%|██▋       | 137/500 [30:35<49:16,  8.14s/it]
 28%|██▊       | 138/500 [30:37<40:00,  6.63s/it]
 28%|██▊       | 139/500 [30:40<32:55,  5.47s/it]
 28%|██▊       | 140/500 [30:43<28:56,  4.82s/it]
 28%|██▊       | 141/500 [32:40<3:38:55, 36.59s/it]
 29%|██▉       | 144/500 [32:40<1:38:28, 16.60s/it]
 29%|██▉       | 146/500 [32:43<1:06:28, 11.27s/it]
 29%|██▉       | 147/500 [32:46<57:10,  9.72s/it]  
 30%|██▉       | 148/500 [32:48<47:09,  8.04s/it]
 30%|██▉       | 149/500 [32:50<38:38,  6.61s/it]
 30%|███       | 150/500 [32:54<33:59,  5.83s/it]
 30%|███       | 151/500 [34:50<3:24:44, 35.20s/it]
 31%|███       | 153/500 [34:50<1:55:43, 20.01s/it]
 31%|███       | 155/500 [34:50<1:11:15, 12.39s/it]
 31%|███▏      | 157/500 [34:54<49:52,  8.73s/it]  
 32%|███▏      | 158/500 [34:56<42:13,  7.41s/it]
 32%|███▏      | 159/500 [34:58<35:35,  6.26s/it]
 32%|███▏      | 160/500 [35:01<31:10,  5.50s/it]
 32%|███▏      | 161/500 [36:58<3:11:53, 33.96s/it]
 33%|███▎      | 164/500 [36:58<1:30:40, 16.19s/it]
 33%|███▎      | 166/500 [36:58<1:00:13, 10.82s/it]
 34%|███▎      | 168/500 [37:03<45:25,  8.21s/it]  
 34%|███▍      | 169/500 [37:06<38:57,  7.06s/it]
 34%|███▍      | 170/500 [37:09<34:28,  6.27s/it]
 34%|███▍      | 171/500 [39:06<2:55:10, 31.95s/it]
 35%|███▍      | 174/500 [39:08<1:29:01, 16.39s/it]
 35%|███▌      | 175/500 [39:12<1:15:20, 13.91s/it]
 35%|███▌      | 176/500 [39:14<1:01:22, 11.37s/it]
 35%|███▌      | 177/500 [39:17<51:02,  9.48s/it]  
 36%|███▌      | 178/500 [39:19<41:02,  7.65s/it]
 36%|███▌      | 179/500 [39:21<32:55,  6.15s/it]
 36%|███▌      | 180/500 [39:25<28:53,  5.42s/it]
 36%|███▌      | 181/500 [41:15<3:05:25, 34.87s/it]
 37%|███▋      | 183/500 [41:15<1:42:16, 19.36s/it]
 37%|███▋      | 185/500 [41:15<1:02:13, 11.85s/it]
 37%|███▋      | 187/500 [41:18<42:39,  8.18s/it]  
 38%|███▊      | 188/500 [41:21<36:22,  7.00s/it]
 38%|███▊      | 189/500 [41:23<30:32,  5.89s/it]
 38%|███▊      | 190/500 [41:26<27:09,  5.26s/it]
 38%|███▊      | 191/500 [43:23<2:55:44, 34.12s/it]
 39%|███▊      | 193/500 [43:23<1:40:38, 19.67s/it]
 39%|███▉      | 195/500 [43:23<1:02:21, 12.27s/it]
 39%|███▉      | 197/500 [43:27<43:49,  8.68s/it]  
 40%|███▉      | 198/500 [43:30<37:07,  7.37s/it]
 40%|███▉      | 199/500 [43:32<31:17,  6.24s/it]
 40%|████      | 200/500 [43:35<27:25,  5.49s/it]
 40%|████      | 201/500 [45:40<2:59:25, 36.01s/it]
 41%|████      | 204/500 [45:40<1:24:47, 17.19s/it]
 41%|████      | 206/500 [45:40<56:52, 11.61s/it]  
 41%|████▏     | 207/500 [45:44<48:51, 10.01s/it]
 42%|████▏     | 208/500 [45:46<40:29,  8.32s/it]
 42%|████▏     | 209/500 [45:48<33:27,  6.90s/it]
 42%|████▏     | 210/500 [45:51<28:46,  5.95s/it]
 42%|████▏     | 211/500 [47:49<2:50:29, 35.40s/it]
 43%|████▎     | 214/500 [47:49<1:19:14, 16.62s/it]
 43%|████▎     | 215/500 [47:50<1:03:47, 13.43s/it]
 43%|████▎     | 216/500 [47:52<51:48, 10.94s/it]  
 43%|████▎     | 217/500 [47:55<42:39,  9.04s/it]
 44%|████▎     | 218/500 [47:57<34:20,  7.31s/it]
 44%|████▍     | 219/500 [48:00<27:57,  5.97s/it]
 44%|████▍     | 220/500 [48:03<24:06,  5.17s/it]
 44%|████▍     | 221/500 [49:59<2:50:39, 36.70s/it]
 45%|████▍     | 224/500 [49:59<1:16:17, 16.59s/it]
 45%|████▌     | 226/500 [50:01<51:22, 11.25s/it]  
 45%|████▌     | 227/500 [50:05<44:12,  9.72s/it]
 46%|████▌     | 228/500 [50:07<36:26,  8.04s/it]
 46%|████▌     | 229/500 [50:09<29:51,  6.61s/it]
 46%|████▌     | 230/500 [50:12<26:07,  5.81s/it]
 46%|████▌     | 231/500 [52:07<2:36:35, 34.93s/it]
 47%|████▋     | 233/500 [52:07<1:28:20, 19.85s/it]
 47%|████▋     | 235/500 [52:08<54:17, 12.29s/it]  
 47%|████▋     | 237/500 [52:12<37:59,  8.67s/it]
 48%|████▊     | 238/500 [52:14<32:09,  7.36s/it]
 48%|████▊     | 239/500 [52:16<27:05,  6.23s/it]
 48%|████▊     | 240/500 [52:19<23:44,  5.48s/it]
 48%|████▊     | 241/500 [54:16<2:26:34, 33.96s/it]
 49%|████▉     | 244/500 [54:16<1:09:03, 16.19s/it]
 49%|████▉     | 246/500 [54:18<47:11, 11.15s/it]  
 49%|████▉     | 247/500 [54:21<40:43,  9.66s/it]
 50%|████▉     | 248/500 [54:23<33:41,  8.02s/it]
 50%|████▉     | 249/500 [54:25<27:40,  6.62s/it]
 50%|█████     | 250/500 [54:29<24:17,  5.83s/it]
 50%|█████     | 251/500 [56:32<2:32:45, 36.81s/it]
 51%|█████     | 254/500 [56:32<1:10:51, 17.28s/it]
 51%|█████     | 256/500 [56:33<47:13, 11.61s/it]  
 51%|█████▏    | 257/500 [56:36<40:30, 10.00s/it]
 52%|█████▏    | 258/500 [56:38<33:30,  8.31s/it]
 52%|█████▏    | 259/500 [56:41<27:39,  6.89s/it]
 52%|█████▏    | 260/500 [56:44<23:45,  5.94s/it]
 52%|█████▏    | 261/500 [58:40<2:20:16, 35.21s/it]
 53%|█████▎    | 264/500 [58:40<1:04:56, 16.51s/it]
 53%|█████▎    | 267/500 [58:42<37:36,  9.68s/it]  
 54%|█████▎    | 268/500 [58:44<32:23,  8.38s/it]
 54%|█████▍    | 269/500 [58:47<27:35,  7.17s/it]
 54%|█████▍    | 270/500 [58:50<24:12,  6.32s/it]
 54%|█████▍    | 271/500 [1:00:49<2:06:17, 33.09s/it]
 55%|█████▍    | 274/500 [1:00:49<1:01:47, 16.41s/it]
 55%|█████▌    | 276/500 [1:00:50<41:50, 11.21s/it]  
 55%|█████▌    | 277/500 [1:00:53<36:07,  9.72s/it]
 56%|█████▌    | 278/500 [1:00:55<30:01,  8.12s/it]
 56%|█████▌    | 279/500 [1:00:57<24:52,  6.75s/it]
 56%|█████▌    | 280/500 [1:01:00<21:26,  5.85s/it]
 56%|█████▌    | 281/500 [1:02:57<2:07:35, 34.96s/it]
 57%|█████▋    | 284/500 [1:02:57<59:17, 16.47s/it]  
 57%|█████▋    | 285/500 [1:02:58<47:42, 13.31s/it]
 57%|█████▋    | 286/500 [1:03:00<38:42, 10.85s/it]
 57%|█████▋    | 287/500 [1:03:03<31:52,  8.98s/it]
 58%|█████▊    | 288/500 [1:03:06<25:37,  7.25s/it]
 58%|█████▊    | 289/500 [1:03:08<20:51,  5.93s/it]
 58%|█████▊    | 290/500 [1:03:11<17:59,  5.14s/it]
 58%|█████▊    | 291/500 [1:05:08<2:07:56, 36.73s/it]
 59%|█████▉    | 294/500 [1:05:08<56:59, 16.60s/it]  
 59%|█████▉    | 295/500 [1:05:09<45:32, 13.33s/it]
 59%|█████▉    | 296/500 [1:05:11<36:45, 10.81s/it]
 59%|█████▉    | 297/500 [1:05:14<30:11,  8.92s/it]
 60%|█████▉    | 298/500 [1:05:16<24:12,  7.19s/it]
 60%|█████▉    | 299/500 [1:05:19<20:24,  6.09s/it]
 60%|██████    | 300/500 [1:05:22<16:43,  5.02s/it]
 60%|██████    | 301/500 [1:07:16<2:00:00, 36.19s/it]
 61%|██████    | 303/500 [1:07:17<1:06:05, 20.13s/it]
 61%|██████    | 304/500 [1:07:19<51:36, 15.80s/it]  
 61%|██████    | 305/500 [1:07:22<40:45, 12.54s/it]
 61%|██████    | 306/500 [1:07:25<31:36,  9.78s/it]
 61%|██████▏   | 307/500 [1:07:28<25:33,  7.95s/it]
 62%|██████▏   | 308/500 [1:07:30<20:15,  6.33s/it]
 62%|██████▏   | 309/500 [1:07:32<16:24,  5.16s/it]
 62%|██████▏   | 310/500 [1:07:35<14:26,  4.56s/it]
 62%|██████▏   | 311/500 [1:09:24<1:51:01, 35.24s/it]
 63%|██████▎   | 313/500 [1:09:24<59:45, 19.17s/it]  
 63%|██████▎   | 315/500 [1:09:24<35:50, 11.62s/it]
 63%|██████▎   | 316/500 [1:09:26<29:09,  9.51s/it]
 63%|██████▎   | 317/500 [1:09:30<24:35,  8.06s/it]
 64%|██████▎   | 318/500 [1:09:32<19:50,  6.54s/it]
 64%|██████▍   | 319/500 [1:09:34<16:07,  5.34s/it]
 64%|██████▍   | 320/500 [1:09:37<14:26,  4.81s/it]
 64%|██████▍   | 321/500 [1:11:32<1:47:17, 35.97s/it]
 65%|██████▍   | 324/500 [1:11:33<47:47, 16.29s/it]  
 65%|██████▌   | 326/500 [1:11:35<32:02, 11.05s/it]
 65%|██████▌   | 327/500 [1:11:38<27:31,  9.55s/it]
 66%|██████▌   | 328/500 [1:11:40<22:40,  7.91s/it]
 66%|██████▌   | 329/500 [1:11:42<18:33,  6.51s/it]
 66%|██████▌   | 330/500 [1:11:46<16:16,  5.74s/it]
 66%|██████▌   | 331/500 [1:13:41<1:38:12, 34.87s/it]
 67%|██████▋   | 334/500 [1:13:41<45:06, 16.30s/it]  
 67%|██████▋   | 336/500 [1:13:41<29:36, 10.83s/it]
 68%|██████▊   | 338/500 [1:13:46<22:08,  8.20s/it]
 68%|██████▊   | 339/500 [1:13:48<18:54,  7.05s/it]
 68%|██████▊   | 340/500 [1:13:52<16:40,  6.25s/it]
 68%|██████▊   | 341/500 [1:15:49<1:25:10, 32.14s/it]
 69%|██████▊   | 343/500 [1:15:50<50:35, 19.34s/it]  
 69%|██████▉   | 345/500 [1:15:50<31:51, 12.33s/it]
 69%|██████▉   | 347/500 [1:15:52<21:36,  8.47s/it]
 70%|██████▉   | 348/500 [1:15:54<18:15,  7.21s/it]
 70%|██████▉   | 349/500 [1:15:56<15:22,  6.11s/it]
 70%|███████   | 350/500 [1:15:59<13:36,  5.44s/it]
 70%|███████   | 351/500 [1:17:58<1:24:45, 34.13s/it]
 71%|███████   | 354/500 [1:17:58<39:50, 16.37s/it]  
 71%|███████   | 356/500 [1:17:59<26:35, 11.08s/it]
 71%|███████▏  | 357/500 [1:18:02<22:50,  9.58s/it]
 72%|███████▏  | 358/500 [1:18:04<18:54,  7.99s/it]
 72%|███████▏  | 359/500 [1:18:06<15:36,  6.64s/it]
 72%|███████▏  | 360/500 [1:18:09<13:25,  5.76s/it]
 72%|███████▏  | 361/500 [1:20:06<1:21:00, 34.97s/it]
 73%|███████▎  | 363/500 [1:20:06<45:33, 19.95s/it]  
 73%|███████▎  | 365/500 [1:20:06<27:51, 12.38s/it]
 73%|███████▎  | 367/500 [1:20:11<19:54,  8.98s/it]
 74%|███████▎  | 368/500 [1:20:14<16:42,  7.59s/it]
 74%|███████▍  | 369/500 [1:20:16<13:52,  6.35s/it]
 74%|███████▍  | 370/500 [1:20:19<12:15,  5.66s/it]
 74%|███████▍  | 371/500 [1:22:14<1:12:31, 33.73s/it]
 75%|███████▍  | 373/500 [1:22:14<41:14, 19.48s/it]  
 75%|███████▌  | 376/500 [1:22:14<21:10, 10.24s/it]
 76%|███████▌  | 378/500 [1:22:20<16:02,  7.89s/it]
 76%|███████▌  | 379/500 [1:22:22<13:46,  6.83s/it]
 76%|███████▌  | 380/500 [1:22:25<12:13,  6.12s/it]
 76%|███████▌  | 381/500 [1:24:22<1:02:18, 31.42s/it]
 77%|███████▋  | 383/500 [1:24:22<37:09, 19.05s/it]  
 77%|███████▋  | 385/500 [1:24:23<23:23, 12.21s/it]
 77%|███████▋  | 387/500 [1:24:28<16:55,  8.99s/it]
 78%|███████▊  | 388/500 [1:24:30<14:15,  7.64s/it]
 78%|███████▊  | 389/500 [1:24:32<11:52,  6.42s/it]
 78%|███████▊  | 390/500 [1:24:36<10:29,  5.72s/it]
 78%|███████▊  | 391/500 [1:26:36<1:03:22, 34.88s/it]
 79%|███████▊  | 393/500 [1:26:37<36:07, 20.26s/it]  
 79%|███████▉  | 394/500 [1:26:39<28:20, 16.05s/it]
 79%|███████▉  | 395/500 [1:26:42<22:37, 12.93s/it]
 79%|███████▉  | 396/500 [1:26:44<17:29, 10.09s/it]
 79%|███████▉  | 397/500 [1:26:48<14:10,  8.26s/it]
 80%|███████▉  | 398/500 [1:26:50<11:08,  6.56s/it]
 80%|███████▉  | 399/500 [1:26:52<08:50,  5.25s/it]
 80%|████████  | 400/500 [1:26:55<07:53,  4.73s/it]
 80%|████████  | 401/500 [1:28:45<58:27, 35.43s/it]
 81%|████████  | 404/500 [1:28:46<25:23, 15.87s/it]
 81%|████████  | 405/500 [1:28:49<20:56, 13.23s/it]
 81%|████████  | 406/500 [1:28:51<16:43, 10.68s/it]
 81%|████████▏ | 407/500 [1:28:54<13:42,  8.84s/it]
 82%|████████▏ | 408/500 [1:28:56<10:51,  7.09s/it]
 82%|████████▏ | 409/500 [1:28:59<08:45,  5.77s/it]
 82%|████████▏ | 410/500 [1:29:02<07:33,  5.04s/it]
 82%|████████▏ | 411/500 [1:30:53<52:19, 35.28s/it]
 83%|████████▎ | 414/500 [1:30:53<22:46, 15.89s/it]
 83%|████████▎ | 416/500 [1:30:53<14:37, 10.44s/it]
 84%|████████▎ | 418/500 [1:30:58<10:47,  7.90s/it]
 84%|████████▍ | 419/500 [1:31:00<09:10,  6.79s/it]
 84%|████████▍ | 420/500 [1:31:04<08:03,  6.04s/it]
 84%|████████▍ | 421/500 [1:33:01<42:12, 32.06s/it]
 85%|████████▍ | 423/500 [1:33:01<24:41, 19.24s/it]
 85%|████████▌ | 425/500 [1:33:01<15:18, 12.25s/it]
 85%|████████▌ | 427/500 [1:33:05<10:38,  8.75s/it]
 86%|████████▌ | 428/500 [1:33:07<08:56,  7.45s/it]
 86%|████████▌ | 429/500 [1:33:10<07:28,  6.31s/it]
 86%|████████▌ | 430/500 [1:33:13<06:28,  5.55s/it]
 86%|████████▌ | 431/500 [1:35:09<38:45, 33.70s/it]
 87%|████████▋ | 433/500 [1:35:09<21:49, 19.55s/it]
 87%|████████▋ | 434/500 [1:35:11<17:03, 15.50s/it]
 87%|████████▋ | 435/500 [1:35:15<13:32, 12.51s/it]
 87%|████████▋ | 436/500 [1:35:17<10:25,  9.78s/it]
 87%|████████▋ | 437/500 [1:35:20<08:25,  8.03s/it]
 88%|████████▊ | 438/500 [1:35:22<06:36,  6.39s/it]
 88%|████████▊ | 439/500 [1:35:24<05:13,  5.13s/it]
 88%|████████▊ | 440/500 [1:35:28<04:39,  4.66s/it]
 88%|████████▊ | 441/500 [1:37:17<34:46, 35.36s/it]
 89%|████████▊ | 443/500 [1:37:17<18:19, 19.28s/it]
 89%|████████▉ | 445/500 [1:37:18<10:43, 11.70s/it]
 89%|████████▉ | 446/500 [1:37:18<08:21,  9.30s/it]
 89%|████████▉ | 447/500 [1:37:22<06:56,  7.85s/it]
 90%|████████▉ | 448/500 [1:37:24<05:33,  6.41s/it]
 90%|████████▉ | 449/500 [1:37:26<04:30,  5.31s/it]
 90%|█████████ | 450/500 [1:37:29<03:55,  4.71s/it]
 90%|█████████ | 451/500 [1:39:25<29:36, 36.25s/it]
 91%|█████████ | 453/500 [1:39:25<15:43, 20.08s/it]
 91%|█████████ | 455/500 [1:39:26<09:12, 12.28s/it]
 91%|█████████▏| 457/500 [1:39:30<06:09,  8.60s/it]
 92%|█████████▏| 458/500 [1:39:32<05:06,  7.29s/it]
 92%|█████████▏| 459/500 [1:39:34<04:12,  6.16s/it]
 92%|█████████▏| 460/500 [1:39:37<03:36,  5.42s/it]
 92%|█████████▏| 461/500 [1:41:33<22:07, 34.03s/it]
 93%|█████████▎| 464/500 [1:41:34<09:42, 16.19s/it]
 93%|█████████▎| 466/500 [1:41:36<06:18, 11.13s/it]
 93%|█████████▎| 467/500 [1:41:39<05:18,  9.65s/it]
 94%|█████████▎| 468/500 [1:41:41<04:16,  8.01s/it]
 94%|█████████▍| 469/500 [1:41:43<03:24,  6.61s/it]
 94%|█████████▍| 470/500 [1:41:47<02:54,  5.83s/it]
 94%|█████████▍| 471/500 [1:43:42<16:46, 34.70s/it]
 95%|█████████▍| 474/500 [1:43:42<07:03, 16.29s/it]
 95%|█████████▌| 476/500 [1:43:44<04:28, 11.17s/it]
 95%|█████████▌| 477/500 [1:43:47<03:42,  9.68s/it]
 96%|█████████▌| 478/500 [1:43:49<02:56,  8.03s/it]
 96%|█████████▌| 479/500 [1:43:52<02:19,  6.62s/it]
 96%|█████████▌| 480/500 [1:43:55<01:56,  5.81s/it]
 96%|█████████▌| 481/500 [1:45:50<11:00, 34.74s/it]
 97%|█████████▋| 484/500 [1:45:50<04:20, 16.30s/it]
 97%|█████████▋| 486/500 [1:45:51<02:33, 10.95s/it]
 97%|█████████▋| 487/500 [1:45:54<02:03,  9.46s/it]
 98%|█████████▊| 488/500 [1:45:56<01:34,  7.88s/it]
 98%|█████████▊| 489/500 [1:45:59<01:12,  6.56s/it]
 98%|█████████▊| 490/500 [1:46:02<00:56,  5.68s/it]
 98%|█████████▊| 491/500 [1:47:58<05:15, 35.01s/it]
 99%|█████████▉| 494/500 [1:47:58<01:38, 16.41s/it]
 99%|█████████▉| 497/500 [1:47:58<00:28,  9.35s/it]
100%|██████████| 500/500 [1:47:58<00:00,  5.80s/it]
100%|██████████| 500/500 [1:47:58<00:00, 12.96s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             10        
Benchmark duration (s):                  6400.54   
Total input tokens:                      10000000  
Total generated tokens:                  2500000   
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         390.59    
Peak output token throughput (tok/s):    530.00    
Peak concurrent requests:                17.00     
Total token throughput (tok/s):          1952.96   
---------------Time to First Token----------------
Mean TTFT (ms):                          11484.20  
Median TTFT (ms):                        13572.49  
P99 TTFT (ms):                           21442.57  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.31     
Median TPOT (ms):                        22.93     
P99 TPOT (ms):                           24.97     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.32     
Median ITL (ms):                         20.38     
P99 ITL (ms):                            40.03     
==================================================